cfd_geometry/tesla_cybertruck/roof_rack/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    movingRR;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1 (-1.726285 -1.00115  -0.428600);
            p2 (-1.726285 -0.671665 -0.428600);
            radius 0.55;
        }
    }
    {
        name    movingFR;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1 (1.948045 -1.00115  -0.428600);
            p2 (1.948045 -0.671665 -0.428600);
            radius 0.55;
        }
    }
);

// ************************************************************************* //
